<a href="https://colab.research.google.com/github/gnbhub/GnB20222_AI_1/blob/master/20221123/1123_woodahyeon.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
'''
이상치 : 중심 경향성에서 멀리 떨어진 값, 기준은 사용자 정의
결측치 : 빈 값, NULL(NAN)값. 제거 or 대체

pd.isna() / pd.isnull() : 결측치 원소 T/F 반환
<=> pd.notna(), pd.notnull()

pd.fillna(value=(value)) : 결측치를 value로 채움, 딕셔너리 사용 가능
ㄴ> method = 'bfill' : 결측치 뒤의 값으로 채움
ㄴ> method = 'ffill' : 결측치 앞의 값으로 채움
'''

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('iris_missing.csv')
df.head()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN

In [ ]:
df_na = df.head(7)
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [ ]:
df_na['Sepal_Length'].isna()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: Sepal_Length, dtype: bool

In [ ]:
df_na['Sepal_Length'].notna()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
Name: Sepal_Length, dtype: bool

In [ ]:
df_na['Sepal_Length'].isna().sum()

1

In [ ]:
df_na.isna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False     True
3         False        False         False        False    False
4         False        False         False        False     True
5         False        False         False        False    False
6          True         True          True         True    False

In [ ]:
df_na.isna().sum() # 각 변수별 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [ ]:
df_na.isna().sum(axis = 1) # 각 row별 결측치 개수

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [ ]:
df_na.fillna(value = 999)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0         999.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     999
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     999
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0         999.0        999.0  setosa

In [ ]:
df_na.fillna(value = {'Sepal_Length':999}) # Sepal_Length의 결측치 999로 채움

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0          NaN           NaN          NaN  setosa

In [ ]:
df_na['Sepal_Width'].mean() # 평균값

3.3600000000000003

In [ ]:
'''
pd.dropna() : 결측치가 있는 row or column 제거
ㄴ> how = ''

pd.
'''

In [ ]:
df_na2 = df.head(7)
df_na2

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [ ]:
df_na2.dropna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [ ]:
df_na2.iloc[:, :-1]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN

In [ ]:
df_na2.iloc[:, :-1].dropna(how = 'all')

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [ ]:
print(df['Sepal_Length'].max())
print(df['Sepal_Length'].min())
print(df['Sepal_Length'].mean()) #최대, 최소, 평균값

7.9
4.3
5.853846153846154

In [ ]:
print(df['Sepal_Length'].median()) # 중간값

5.8

In [ ]:
print(df['Sepal_Length'].quantile())

5.8

In [ ]:
print(df['Sepal_Length'].quantile(q = 0.25)) # 제 1 사분위수
print(df['Sepal_Length'].quantile(q = 0.50)) # 제 2 사분위수
print(df['Sepal_Length'].quantile(q = 0.75)) # 제 3 사분위수

5.1
5.8
6.4

In [ ]:
df['Sepal_Width'].fillna(value = df['Sepal_Width'].mean()).var()

0.17561945818840946

In [ ]:
df = pd.read_csv('iris.csv')
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
e = df['Sepal.Length'].std()

0.8280661279778629

In [ ]:
'''
np.where(조건식, True, False) : 조건에 따라 True일 때 / False일 때
반환값 각각 반환
df.rename() : 데이터프레임 개명
'''

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('iris.csv')
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df['is_setosa'] = np.where(df['Species'] == 'setosa', 1, 0)
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1
2           4.7          3.2           1.3          0.2  setosa          1
3           4.6          3.1           1.5          0.2  setosa          1
4           5.0          3.6           1.4          0.2  setosa          1

In [ ]:
pd.crosstab(df['Species'], df['is_setosa'])

is_setosa    0   1
Species
setosa       0  50
versicolor  50   0
virginica   50   0

In [ ]:
# == np.where()
df['is_setosa_2'] = (df['Species']=='setosa') + 0
df['is_setosa_3'] = (df['Species']=='setosa') * 1
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [ ]:
df.rename(columns = {'Sepal.Length':'SL'})

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,0
146,6.3,2.5,5.0,1.9,virginica,0,0,0
147,6.5,3.0,5.2,2.0,virginica,0,0,0
148,6.2,3.4,5.4,2.3,virginica,0,0,0
149,5.9,3.0,5.1,1.8,virginica,0,0,0

In [ ]:
'''
pd.apply() : row or column 방향으로 일괄 계산
ㄴ> axis 인자 설정 : 연산 방향 설정 (axis = 0: row, 1: column)
pd.astype() : 시리즈 속성 변경 (int, float, str...)
'''

In [ ]:
bike = pd.read_csv('bike.csv')
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa_2,is_setosa_3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [ ]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [ ]:
bike_sub = bike.iloc[:4, 9:11]
print(bike_sub)
bike_sub = bike.loc[:4, ['casual', 'registered']]
print(bike_sub)
bike_sub = bike.loc[:4, 'casual':'registered']
print(bike_sub)

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1
   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [ ]:
bike_sub.sum(axis = 1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [ ]:
bike_sub.apply(func = sum)

casual        19
registered    83
dtype: int64

In [ ]:
bike_sub.apply(func = sum, axis= 1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [ ]:
bike_sub.apply(func = lambda x: round(x.mean()))

casual         4
registered    17
dtype: int64

In [ ]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      5 non-null      int64
 1   registered  5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [ ]:
bike_sub['casual'].astype('str')

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: object

In [ ]:
bike_sub['casual'].astype('str') + '대'

0    3대
1    8대
2    5대
3    3대
4    0대
Name: casual, dtype: object

In [ ]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [ ]:
bike['datetime'][:3]

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
2    2011-01-01 02:00:00
Name: datetime, dtype: object

In [ ]:
bike['datetime'][:3].str.slice(0,4)

0    2011
1    2011
2    2011
Name: datetime, dtype: object

In [ ]:
bike['datetime'][:3].str.slice(5, 7)

0    01
1    01
2    01
Name: datetime, dtype: object

In [ ]:
'''
pd.to_datetime() : datetime 자료형 변환
dt.year, month, day, hour, weekday, etc....
'''

In [ ]:
bike_time = pd.to_datetime(bike['datetime'][:3])
bike_time

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
Name: datetime, dtype: datetime64[ns]

In [ ]:
print(bike_time.dt.year)
print(bike_time.dt.month)
print(bike_time.dt.day)
print(bike_time.dt.hour)
print(bike_time.dt.minute)
print(bike_time.dt.weekday)

0    2011
1    2011
2    2011
Name: datetime, dtype: int64
0    1
1    1
2    1
Name: datetime, dtype: int64
0    1
1    1
2    1
Name: datetime, dtype: int64
0    0
1    1
2    2
Name: datetime, dtype: int64
0    0
1    0
2    0
Name: datetime, dtype: int64
0    5
1    5
2    5
Name: datetime, dtype: int64

In [ ]:
'''
pd.get_dummies() : dummy data 추출
'''

In [ ]:
bike_dum = pd.get_dummies(data = bike, columns = ['season'],
                          drop_first = True)
bike_dum.head(2)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,0,0,0

In [ ]:
#Q1
abs(bike['temp']-bike['atemp']).mean()

3.5091985118501188

In [ ]:
#Q2
bike['25'] = np.where(bike['casual'].max()>25, 1, 0)
bike['25'].sum()

10886

In [ ]:
bike['datetime'] = pd.to_datetime(bike['datetime'])
up = bike.groupby('datetime')['casual'].max()
up

datetime
2011-01-01 00:00:00     3
2011-01-01 01:00:00     8
2011-01-01 02:00:00     5
2011-01-01 03:00:00     3
2011-01-01 04:00:00     0
                       ..
2012-12-19 19:00:00     7
2012-12-19 20:00:00    10
2012-12-19 21:00:00     4
2012-12-19 22:00:00    12
2012-12-19 23:00:00     4
Name: casual, Length: 10886, dtype: int64